GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.h
extern volatile IPR2bits_t IPR2bits __at(0x3982);
// bitfield macros
#define _IPR2_DMA1SCNTIP_POSN                               0x0
#define _IPR2_DMA1SCNTIP_POSITION                           0x0
#define _IPR2_DMA1SCNTIP_SIZE                               0x1
#define _IPR2_DMA1SCNTIP_LENGTH                             0x1
#define _IPR2_DMA1SCNTIP_MASK                               0x1
#define _IPR2_DMA1DCNTIP_POSN                               0x1
#define _IPR2_DMA1DCNTIP_POSITION                           0x1
#define _IPR2_DMA1DCNTIP_SIZE                               0x1
#define _IPR2_DMA1DCNTIP_LENGTH                             0x1
#define _IPR2_DMA1DCNTIP_MASK                               0x2
#define _IPR2_DMA1ORIP_POSN                                 0x2
#define _IPR2_DMA1ORIP_POSITION                             0x2
#define _IPR2_DMA1ORIP_SIZE                                 0x1
#define _IPR2_DMA1ORIP_LENGTH                               0x1
#define _IPR2_DMA1ORIP_MASK                                 0x4
#define _IPR2_DMA1AIP_POSN                                  0x3
#define _IPR2_DMA1AIP_POSITION                              0x3
#define _IPR2_DMA1AIP_SIZE                                  0x1
#define _IPR2_DMA1AIP_LENGTH                                0x1
#define _IPR2_DMA1AIP_MASK                                  0x8
#define _IPR2_SPI1RXIP_POSN                                 0x4
#define _IPR2_SPI1RXIP_POSITION                             0x4
#define _IPR2_SPI1RXIP_SIZE                                 0x1
#define _IPR2_SPI1RXIP_LENGTH                               0x1
#define _IPR2_SPI1RXIP_MASK                                 0x10
#define _IPR2_SPI1TXIP_POSN                                 0x5
#define _IPR2_SPI1TXIP_POSITION                             0x5
#define _IPR2_SPI1TXIP_SIZE                                 0x1
#define _IPR2_SPI1TXIP_LENGTH                               0x1
#define _IPR2_SPI1TXIP_MASK                                 0x20
#define _IPR2_SPI1IP_POSN                                   0x6
#define _IPR2_SPI1IP_POSITION                               0x6
#define _IPR2_SPI1IP_SIZE                                   0x1
#define _IPR2_SPI1IP_LENGTH                                 0x1
#define _IPR2_SPI1IP_MASK                                   0x40
#define _IPR2_I2C1RXIP_POSN                                 0x7
#define _IPR2_I2C1RXIP_POSITION                             0x7
#define _IPR2_I2C1RXIP_SIZE                                 0x1
#define _IPR2_I2C1RXIP_LENGTH                               0x1
#define _IPR2_I2C1RXIP_MASK                                 0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x3983);
#ifndef _LIB_BUILD
asm("IPR3 equ 03983h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1TXIP               :1;
        unsigned I2C1IP                 :1;
        unsigned I2C1EIP                :1;
        unsigned U1RXIP                 :1;
        unsigned U1TXIP                 :1;
        unsigned U1EIP                  :1;
        unsigned U1IP                   :1;
        unsigned TMR0IP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0x3983);
// bitfield macros
#define _IPR3_I2C1TXIP_POSN                                 0x0
#define _IPR3_I2C1TXIP_POSITION                             0x0
#define _IPR3_I2C1TXIP_SIZE                                 0x1
#define _IPR3_I2C1TXIP_LENGTH                               0x1
#define _IPR3_I2C1TXIP_MASK                                 0x1
#define _IPR3_I2C1IP_POSN                                   0x1
#define _IPR3_I2C1IP_POSITION                               0x1
#define _IPR3_I2C1IP_SIZE                                   0x1
#define _IPR3_I2C1IP_LENGTH                                 0x1
#define _IPR3_I2C1IP_MASK                                   0x2
#define _IPR3_I2C1EIP_POSN                                  0x2
#define _IPR3_I2C1EIP_POSITION                              0x2
#define _IPR3_I2C1EIP_SIZE                                  0x1
#define _IPR3_I2C1EIP_LENGTH                                0x1
#define _IPR3_I2C1EIP_MASK                                  0x4
#define _IPR3_U1RXIP_POSN                                   0x3
#define _IPR3_U1RXIP_POSITION                               0x3
#define _IPR3_U1RXIP_SIZE                                   0x1
#define _IPR3_U1RXIP_LENGTH                                 0x1
#define _IPR3_U1RXIP_MASK                                   0x8
#define _IPR3_U1TXIP_POSN                                   0x4
#define _IPR3_U1TXIP_POSITION                               0x4
#define _IPR3_U1TXIP_SIZE                                   0x1
#define _IPR3_U1TXIP_LENGTH                                 0x1
#define _IPR3_U1TXIP_MASK                                   0x10
#define _IPR3_U1EIP_POSN                                    0x5
#define _IPR3_U1EIP_POSITION                                0x5
#define _IPR3_U1EIP_SIZE                                    0x1
#define _IPR3_U1EIP_LENGTH                                  0x1
#define _IPR3_U1EIP_MASK                                    0x20
#define _IPR3_U1IP_POSN                                     0x6
#define _IPR3_U1IP_POSITION                                 0x6
#define _IPR3_U1IP_SIZE                                     0x1
#define _IPR3_U1IP_LENGTH                                   0x1
#define _IPR3_U1IP_MASK                                     0x40
#define _IPR3_TMR0IP_POSN                                   0x7
#define _IPR3_TMR0IP_POSITION                               0x7
#define _IPR3_TMR0IP_SIZE                                   0x1
#define _IPR3_TMR0IP_LENGTH                                 0x1
#define _IPR3_TMR0IP_MASK                                   0x80

// Register: IPR4
#define IPR4 IPR4
extern volatile unsigned char           IPR4                __at(0x3984);
#ifndef _LIB_BUILD
asm("IPR4 equ 03984h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
        unsigned TMR2IP                 :1;
        unsigned CCP1IP                 :1;
        unsigned                        :1;
        unsigned NCO1IP                 :1;
        unsigned CWG1IP                 :1;
        unsigned CLC1IP                 :1;
    };
} IPR4bits_t;
extern volatile IPR4bits_t IPR4bits __at(0x3984);
// bitfield macros
#define _IPR4_TMR1IP_POSN                                   0x0
#define _IPR4_TMR1IP_POSITION                               0x0
#define _IPR4_TMR1IP_SIZE                                   0x1
#define _IPR4_TMR1IP_LENGTH                                 0x1
#define _IPR4_TMR1IP_MASK                                   0x1
#define _IPR4_TMR1GIP_POSN                                  0x1
#define _IPR4_TMR1GIP_POSITION                              0x1
#define _IPR4_TMR1GIP_SIZE                                  0x1
#define _IPR4_TMR1GIP_LENGTH                                0x1
#define _IPR4_TMR1GIP_MASK                                  0x2
#define _IPR4_TMR2IP_POSN                                   0x2
#define _IPR4_TMR2IP_POSITION                               0x2
#define _IPR4_TMR2IP_SIZE                                   0x1
#define _IPR4_TMR2IP_LENGTH                                 0x1
#define _IPR4_TMR2IP_MASK                                   0x4
#define _IPR4_CCP1IP_POSN                                   0x3
#define _IPR4_CCP1IP_POSITION                               0x3
#define _IPR4_CCP1IP_SIZE                                   0x1
#define _IPR4_CCP1IP_LENGTH                                 0x1
#define _IPR4_CCP1IP_MASK                                   0x8
#define _IPR4_NCO1IP_POSN                                   0x5
#define _IPR4_NCO1IP_POSITION                               0x5
#define _IPR4_NCO1IP_SIZE                                   0x1
#define _IPR4_NCO1IP_LENGTH                                 0x1
#define _IPR4_NCO1IP_MASK                                   0x20
#define _IPR4_CWG1IP_POSN                                   0x6
#define _IPR4_CWG1IP_POSITION                               0x6
#define _IPR4_CWG1IP_SIZE                                   0x1
#define _IPR4_CWG1IP_LENGTH                                 0x1
#define _IPR4_CWG1IP_MASK                                   0x40
#define _IPR4_CLC1IP_POSN                                   0x7
#define _IPR4_CLC1IP_POSITION                               0x7
#define _IPR4_CLC1IP_SIZE                                   0x1
#define _IPR4_CLC1IP_LENGTH                                 0x1
#define _IPR4_CLC1IP_MASK                                   0x80

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0x3985);
#ifndef _LIB_BUILD
asm("IPR5 equ 03985h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IP                 :1;
        unsigned C2IP                   :1;
        unsigned DMA2SCNTIP             :1;
        unsigned DMA2DCNTIP             :1;
        unsigned DMA2ORIP               :1;
        unsigned DMA2AIP                :1;
        unsigned I2C2RXIP               :1;
        unsigned I2C2TXIP               :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0x3985);
// bitfield macros
#define _IPR5_INT1IP_POSN                                   0x0
#define _IPR5_INT1IP_POSITION                               0x0
#define _IPR5_INT1IP_SIZE                                   0x1
#define _IPR5_INT1IP_LENGTH                                 0x1
#define _IPR5_INT1IP_MASK                                   0x1
#define _IPR5_C2IP_POSN                                     0x1
#define _IPR5_C2IP_POSITION                                 0x1
#define _IPR5_C2IP_SIZE                                     0x1
#define _IPR5_C2IP_LENGTH                                   0x1
#define _IPR5_C2IP_MASK                                     0x2
#define _IPR5_DMA2SCNTIP_POSN                               0x2
#define _IPR5_DMA2SCNTIP_POSITION                           0x2
#define _IPR5_DMA2SCNTIP_SIZE                               0x1
#define _IPR5_DMA2SCNTIP_LENGTH                             0x1
#define _IPR5_DMA2SCNTIP_MASK                               0x4
#define _IPR5_DMA2DCNTIP_POSN                               0x3
#define _IPR5_DMA2DCNTIP_POSITION                           0x3
#define _IPR5_DMA2DCNTIP_SIZE                               0x1
#define _IPR5_DMA2DCNTIP_LENGTH                             0x1
#define _IPR5_DMA2DCNTIP_MASK                               0x8
#define _IPR5_DMA2ORIP_POSN                                 0x4
#define _IPR5_DMA2ORIP_POSITION                             0x4
#define _IPR5_DMA2ORIP_SIZE                                 0x1
#define _IPR5_DMA2ORIP_LENGTH                               0x1
#define _IPR5_DMA2ORIP_MASK                                 0x10
#define _IPR5_DMA2AIP_POSN                                  0x5
#define _IPR5_DMA2AIP_POSITION                              0x5
#define _IPR5_DMA2AIP_SIZE                                  0x1
#define _IPR5_DMA2AIP_LENGTH                                0x1
#define _IPR5_DMA2AIP_MASK                                  0x20
#define _IPR5_I2C2RXIP_POSN                                 0x6
#define _IPR5_I2C2RXIP_POSITION                             0x6
#define _IPR5_I2C2RXIP_SIZE                                 0x1
#define _IPR5_I2C2RXIP_LENGTH                               0x1
#define _IPR5_I2C2RXIP_MASK                                 0x40
#define _IPR5_I2C2TXIP_POSN                                 0x7
#define _IPR5_I2C2TXIP_POSITION                             0x7
#define _IPR5_I2C2TXIP_SIZE                                 0x1
#define _IPR5_I2C2TXIP_LENGTH                               0x1
#define _IPR5_I2C2TXIP_MASK                                 0x80

