GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.h
// Register: DMA1SPTRH
#define DMA1SPTRH DMA1SPTRH
extern volatile unsigned char           DMA1SPTRH           __at(0x3BF5);
#ifndef _LIB_BUILD
asm("DMA1SPTRH equ 03BF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :8;
    };
    struct {
        unsigned SPTR8                  :1;
        unsigned SPTR9                  :1;
        unsigned SPTR10                 :1;
        unsigned SPTR11                 :1;
        unsigned SPTR12                 :1;
        unsigned SPTR13                 :1;
        unsigned SPTR14                 :1;
        unsigned SPTR15                 :1;
    };
    struct {
        unsigned DMA1SPTR               :8;
    };
    struct {
        unsigned DMA1SPTR8              :1;
        unsigned DMA1SPTR9              :1;
        unsigned DMA1SPTR10             :1;
        unsigned DMA1SPTR11             :1;
        unsigned DMA1SPTR12             :1;
        unsigned DMA1SPTR13             :1;
        unsigned DMA1SPTR14             :1;
        unsigned DMA1SPTR15             :1;
    };
} DMA1SPTRHbits_t;
extern volatile DMA1SPTRHbits_t DMA1SPTRHbits __at(0x3BF5);
// bitfield macros
#define _DMA1SPTRH_SPTR_POSN                                0x0
#define _DMA1SPTRH_SPTR_POSITION                            0x0
#define _DMA1SPTRH_SPTR_SIZE                                0x8
#define _DMA1SPTRH_SPTR_LENGTH                              0x8
#define _DMA1SPTRH_SPTR_MASK                                0xFF
#define _DMA1SPTRH_SPTR8_POSN                               0x0
#define _DMA1SPTRH_SPTR8_POSITION                           0x0
#define _DMA1SPTRH_SPTR8_SIZE                               0x1
#define _DMA1SPTRH_SPTR8_LENGTH                             0x1
#define _DMA1SPTRH_SPTR8_MASK                               0x1
#define _DMA1SPTRH_SPTR9_POSN                               0x1
#define _DMA1SPTRH_SPTR9_POSITION                           0x1
#define _DMA1SPTRH_SPTR9_SIZE                               0x1
#define _DMA1SPTRH_SPTR9_LENGTH                             0x1
#define _DMA1SPTRH_SPTR9_MASK                               0x2
#define _DMA1SPTRH_SPTR10_POSN                              0x2
#define _DMA1SPTRH_SPTR10_POSITION                          0x2
#define _DMA1SPTRH_SPTR10_SIZE                              0x1
#define _DMA1SPTRH_SPTR10_LENGTH                            0x1
#define _DMA1SPTRH_SPTR10_MASK                              0x4
#define _DMA1SPTRH_SPTR11_POSN                              0x3
#define _DMA1SPTRH_SPTR11_POSITION                          0x3
#define _DMA1SPTRH_SPTR11_SIZE                              0x1
#define _DMA1SPTRH_SPTR11_LENGTH                            0x1
#define _DMA1SPTRH_SPTR11_MASK                              0x8
#define _DMA1SPTRH_SPTR12_POSN                              0x4
#define _DMA1SPTRH_SPTR12_POSITION                          0x4
#define _DMA1SPTRH_SPTR12_SIZE                              0x1
#define _DMA1SPTRH_SPTR12_LENGTH                            0x1
#define _DMA1SPTRH_SPTR12_MASK                              0x10
#define _DMA1SPTRH_SPTR13_POSN                              0x5
#define _DMA1SPTRH_SPTR13_POSITION                          0x5
#define _DMA1SPTRH_SPTR13_SIZE                              0x1
#define _DMA1SPTRH_SPTR13_LENGTH                            0x1
#define _DMA1SPTRH_SPTR13_MASK                              0x20
#define _DMA1SPTRH_SPTR14_POSN                              0x6
#define _DMA1SPTRH_SPTR14_POSITION                          0x6
#define _DMA1SPTRH_SPTR14_SIZE                              0x1
#define _DMA1SPTRH_SPTR14_LENGTH                            0x1
#define _DMA1SPTRH_SPTR14_MASK                              0x40
#define _DMA1SPTRH_SPTR15_POSN                              0x7
#define _DMA1SPTRH_SPTR15_POSITION                          0x7
#define _DMA1SPTRH_SPTR15_SIZE                              0x1
#define _DMA1SPTRH_SPTR15_LENGTH                            0x1
#define _DMA1SPTRH_SPTR15_MASK                              0x80
#define _DMA1SPTRH_DMA1SPTR_POSN                            0x0
#define _DMA1SPTRH_DMA1SPTR_POSITION                        0x0
#define _DMA1SPTRH_DMA1SPTR_SIZE                            0x8
#define _DMA1SPTRH_DMA1SPTR_LENGTH                          0x8
#define _DMA1SPTRH_DMA1SPTR_MASK                            0xFF
#define _DMA1SPTRH_DMA1SPTR8_POSN                           0x0
#define _DMA1SPTRH_DMA1SPTR8_POSITION                       0x0
#define _DMA1SPTRH_DMA1SPTR8_SIZE                           0x1
#define _DMA1SPTRH_DMA1SPTR8_LENGTH                         0x1
#define _DMA1SPTRH_DMA1SPTR8_MASK                           0x1
#define _DMA1SPTRH_DMA1SPTR9_POSN                           0x1
#define _DMA1SPTRH_DMA1SPTR9_POSITION                       0x1
#define _DMA1SPTRH_DMA1SPTR9_SIZE                           0x1
#define _DMA1SPTRH_DMA1SPTR9_LENGTH                         0x1
#define _DMA1SPTRH_DMA1SPTR9_MASK                           0x2
#define _DMA1SPTRH_DMA1SPTR10_POSN                          0x2
#define _DMA1SPTRH_DMA1SPTR10_POSITION                      0x2
#define _DMA1SPTRH_DMA1SPTR10_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR10_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR10_MASK                          0x4
#define _DMA1SPTRH_DMA1SPTR11_POSN                          0x3
#define _DMA1SPTRH_DMA1SPTR11_POSITION                      0x3
#define _DMA1SPTRH_DMA1SPTR11_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR11_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR11_MASK                          0x8
#define _DMA1SPTRH_DMA1SPTR12_POSN                          0x4
#define _DMA1SPTRH_DMA1SPTR12_POSITION                      0x4
#define _DMA1SPTRH_DMA1SPTR12_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR12_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR12_MASK                          0x10
#define _DMA1SPTRH_DMA1SPTR13_POSN                          0x5
#define _DMA1SPTRH_DMA1SPTR13_POSITION                      0x5
#define _DMA1SPTRH_DMA1SPTR13_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR13_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR13_MASK                          0x20
#define _DMA1SPTRH_DMA1SPTR14_POSN                          0x6
#define _DMA1SPTRH_DMA1SPTR14_POSITION                      0x6
#define _DMA1SPTRH_DMA1SPTR14_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR14_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR14_MASK                          0x40
#define _DMA1SPTRH_DMA1SPTR15_POSN                          0x7
#define _DMA1SPTRH_DMA1SPTR15_POSITION                      0x7
#define _DMA1SPTRH_DMA1SPTR15_SIZE                          0x1
#define _DMA1SPTRH_DMA1SPTR15_LENGTH                        0x1
#define _DMA1SPTRH_DMA1SPTR15_MASK                          0x80

// Register: DMA1SPTRU
#define DMA1SPTRU DMA1SPTRU
extern volatile unsigned char           DMA1SPTRU           __at(0x3BF6);
#ifndef _LIB_BUILD
asm("DMA1SPTRU equ 03BF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPTR                   :6;
    };
    struct {
        unsigned SPTR16                 :1;
        unsigned SPTR17                 :1;
        unsigned SPTR18                 :1;
        unsigned SPTR19                 :1;
        unsigned SPTR20                 :1;
        unsigned SPTR21                 :1;
    };
    struct {
        unsigned DMA1SPTR               :6;
    };
    struct {
        unsigned DMA1SPTR16             :1;
        unsigned DMA1SPTR17             :1;
        unsigned DMA1SPTR18             :1;
        unsigned DMA1SPTR19             :1;
        unsigned DMA1SPTR20             :1;
        unsigned DMA1SPTR21             :1;
    };
} DMA1SPTRUbits_t;
