GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.h
// Register: I2C1BTO
#define I2C1BTO I2C1BTO
extern volatile unsigned char           I2C1BTO             __at(0x3D7C);
#ifndef _LIB_BUILD
asm("I2C1BTO equ 03D7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BTO                    :8;
    };
    struct {
        unsigned I2CBTO                 :8;
    };
    struct {
        unsigned BTO0                   :1;
        unsigned BTO1                   :1;
        unsigned BTO2                   :1;
    };
    struct {
        unsigned I2CBTO0                :1;
        unsigned I2CBTO1                :1;
        unsigned I2CBTO2                :1;
    };
} I2C1BTObits_t;
extern volatile I2C1BTObits_t I2C1BTObits __at(0x3D7C);
// bitfield macros
#define _I2C1BTO_BTO_POSN                                   0x0
#define _I2C1BTO_BTO_POSITION                               0x0
#define _I2C1BTO_BTO_SIZE                                   0x8
#define _I2C1BTO_BTO_LENGTH                                 0x8
#define _I2C1BTO_BTO_MASK                                   0xFF
#define _I2C1BTO_I2CBTO_POSN                                0x0
#define _I2C1BTO_I2CBTO_POSITION                            0x0
#define _I2C1BTO_I2CBTO_SIZE                                0x8
#define _I2C1BTO_I2CBTO_LENGTH                              0x8
#define _I2C1BTO_I2CBTO_MASK                                0xFF
#define _I2C1BTO_BTO0_POSN                                  0x0
#define _I2C1BTO_BTO0_POSITION                              0x0
#define _I2C1BTO_BTO0_SIZE                                  0x1
#define _I2C1BTO_BTO0_LENGTH                                0x1
#define _I2C1BTO_BTO0_MASK                                  0x1
#define _I2C1BTO_BTO1_POSN                                  0x1
#define _I2C1BTO_BTO1_POSITION                              0x1
#define _I2C1BTO_BTO1_SIZE                                  0x1
#define _I2C1BTO_BTO1_LENGTH                                0x1
#define _I2C1BTO_BTO1_MASK                                  0x2
#define _I2C1BTO_BTO2_POSN                                  0x2
#define _I2C1BTO_BTO2_POSITION                              0x2
#define _I2C1BTO_BTO2_SIZE                                  0x1
#define _I2C1BTO_BTO2_LENGTH                                0x1
#define _I2C1BTO_BTO2_MASK                                  0x4
#define _I2C1BTO_I2CBTO0_POSN                               0x0
#define _I2C1BTO_I2CBTO0_POSITION                           0x0
#define _I2C1BTO_I2CBTO0_SIZE                               0x1
#define _I2C1BTO_I2CBTO0_LENGTH                             0x1
#define _I2C1BTO_I2CBTO0_MASK                               0x1
#define _I2C1BTO_I2CBTO1_POSN                               0x1
#define _I2C1BTO_I2CBTO1_POSITION                           0x1
#define _I2C1BTO_I2CBTO1_SIZE                               0x1
#define _I2C1BTO_I2CBTO1_LENGTH                             0x1
#define _I2C1BTO_I2CBTO1_MASK                               0x2
#define _I2C1BTO_I2CBTO2_POSN                               0x2
#define _I2C1BTO_I2CBTO2_POSITION                           0x2
#define _I2C1BTO_I2CBTO2_SIZE                               0x1
#define _I2C1BTO_I2CBTO2_LENGTH                             0x1
#define _I2C1BTO_I2CBTO2_MASK                               0x4

// Register: U2RXB
#define U2RXB U2RXB
extern volatile unsigned char           U2RXB               __at(0x3DD0);
#ifndef _LIB_BUILD
asm("U2RXB equ 03DD0h");
#endif
// aliases
extern volatile unsigned char           U2RXBL              __at(0x3DD0);
#ifndef _LIB_BUILD
asm("U2RXBL equ 03DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBbits_t;
extern volatile U2RXBbits_t U2RXBbits __at(0x3DD0);
// bitfield macros
#define _U2RXB_RXB_POSN                                     0x0
#define _U2RXB_RXB_POSITION                                 0x0
#define _U2RXB_RXB_SIZE                                     0x8
#define _U2RXB_RXB_LENGTH                                   0x8
#define _U2RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U2RXBLbits_t;
extern volatile U2RXBLbits_t U2RXBLbits __at(0x3DD0);
// bitfield macros
#define _U2RXBL_RXB_POSN                                    0x0
#define _U2RXBL_RXB_POSITION                                0x0
#define _U2RXBL_RXB_SIZE                                    0x8
#define _U2RXBL_RXB_LENGTH                                  0x8
#define _U2RXBL_RXB_MASK                                    0xFF

// Register: U2TXB
#define U2TXB U2TXB
extern volatile unsigned char           U2TXB               __at(0x3DD2);
#ifndef _LIB_BUILD
asm("U2TXB equ 03DD2h");
#endif
// aliases
extern volatile unsigned char           U2TXBL              __at(0x3DD2);
#ifndef _LIB_BUILD
asm("U2TXBL equ 03DD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBbits_t;
extern volatile U2TXBbits_t U2TXBbits __at(0x3DD2);
// bitfield macros
#define _U2TXB_TXB_POSN                                     0x0
#define _U2TXB_TXB_POSITION                                 0x0
#define _U2TXB_TXB_SIZE                                     0x8
#define _U2TXB_TXB_LENGTH                                   0x8
#define _U2TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U2TXBLbits_t;
extern volatile U2TXBLbits_t U2TXBLbits __at(0x3DD2);
// bitfield macros
#define _U2TXBL_TXB_POSN                                    0x0
#define _U2TXBL_TXB_POSITION                                0x0
#define _U2TXBL_TXB_SIZE                                    0x8
#define _U2TXBL_TXB_LENGTH                                  0x8
#define _U2TXBL_TXB_MASK                                    0xFF

// Register: U2P1
#define U2P1 U2P1
extern volatile unsigned char           U2P1                __at(0x3DD4);
#ifndef _LIB_BUILD
asm("U2P1 equ 03DD4h");
#endif

// Register: U2P1L
#define U2P1L U2P1L
extern volatile unsigned char           U2P1L               __at(0x3DD4);
#ifndef _LIB_BUILD
asm("U2P1L equ 03DD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U2P1Lbits_t;
