GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.h
extern volatile U2UIRbits_t U2UIRbits __at(0x3DE0);
// bitfield macros
#define _U2UIR_ABDIE_POSN                                   0x2
#define _U2UIR_ABDIE_POSITION                               0x2
#define _U2UIR_ABDIE_SIZE                                   0x1
#define _U2UIR_ABDIE_LENGTH                                 0x1
#define _U2UIR_ABDIE_MASK                                   0x4
#define _U2UIR_ABDIF_POSN                                   0x6
#define _U2UIR_ABDIF_POSITION                               0x6
#define _U2UIR_ABDIF_SIZE                                   0x1
#define _U2UIR_ABDIF_LENGTH                                 0x1
#define _U2UIR_ABDIF_MASK                                   0x40
#define _U2UIR_WUIF_POSN                                    0x7
#define _U2UIR_WUIF_POSITION                                0x7
#define _U2UIR_WUIF_SIZE                                    0x1
#define _U2UIR_WUIF_LENGTH                                  0x1
#define _U2UIR_WUIF_MASK                                    0x80
#define _U2UIR_U2ABDIE_POSN                                 0x2
#define _U2UIR_U2ABDIE_POSITION                             0x2
#define _U2UIR_U2ABDIE_SIZE                                 0x1
#define _U2UIR_U2ABDIE_LENGTH                               0x1
#define _U2UIR_U2ABDIE_MASK                                 0x4
#define _U2UIR_U2ABDIF_POSN                                 0x6
#define _U2UIR_U2ABDIF_POSITION                             0x6
#define _U2UIR_U2ABDIF_SIZE                                 0x1
#define _U2UIR_U2ABDIF_LENGTH                               0x1
#define _U2UIR_U2ABDIF_MASK                                 0x40
#define _U2UIR_U2WUIF_POSN                                  0x7
#define _U2UIR_U2WUIF_POSITION                              0x7
#define _U2UIR_U2WUIF_SIZE                                  0x1
#define _U2UIR_U2WUIF_LENGTH                                0x1
#define _U2UIR_U2WUIF_MASK                                  0x80

// Register: U2ERRIR
#define U2ERRIR U2ERRIR
extern volatile unsigned char           U2ERRIR             __at(0x3DE1);
#ifndef _LIB_BUILD
asm("U2ERRIR equ 03DE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U2TXCIF                :1;
        unsigned U2RXFOIF               :1;
        unsigned U2RXBKIF               :1;
        unsigned U2FERIF                :1;
        unsigned U2CERIF                :1;
        unsigned U2ABDOVF               :1;
        unsigned U2PERIF                :1;
        unsigned U2TXMTIF               :1;
    };
} U2ERRIRbits_t;
extern volatile U2ERRIRbits_t U2ERRIRbits __at(0x3DE1);
// bitfield macros
#define _U2ERRIR_TXCIF_POSN                                 0x0
#define _U2ERRIR_TXCIF_POSITION                             0x0
#define _U2ERRIR_TXCIF_SIZE                                 0x1
#define _U2ERRIR_TXCIF_LENGTH                               0x1
#define _U2ERRIR_TXCIF_MASK                                 0x1
#define _U2ERRIR_RXFOIF_POSN                                0x1
#define _U2ERRIR_RXFOIF_POSITION                            0x1
#define _U2ERRIR_RXFOIF_SIZE                                0x1
#define _U2ERRIR_RXFOIF_LENGTH                              0x1
#define _U2ERRIR_RXFOIF_MASK                                0x2
#define _U2ERRIR_RXBKIF_POSN                                0x2
#define _U2ERRIR_RXBKIF_POSITION                            0x2
#define _U2ERRIR_RXBKIF_SIZE                                0x1
#define _U2ERRIR_RXBKIF_LENGTH                              0x1
#define _U2ERRIR_RXBKIF_MASK                                0x4
#define _U2ERRIR_FERIF_POSN                                 0x3
#define _U2ERRIR_FERIF_POSITION                             0x3
#define _U2ERRIR_FERIF_SIZE                                 0x1
#define _U2ERRIR_FERIF_LENGTH                               0x1
#define _U2ERRIR_FERIF_MASK                                 0x8
#define _U2ERRIR_CERIF_POSN                                 0x4
#define _U2ERRIR_CERIF_POSITION                             0x4
#define _U2ERRIR_CERIF_SIZE                                 0x1
#define _U2ERRIR_CERIF_LENGTH                               0x1
#define _U2ERRIR_CERIF_MASK                                 0x10
#define _U2ERRIR_ABDOVF_POSN                                0x5
#define _U2ERRIR_ABDOVF_POSITION                            0x5
#define _U2ERRIR_ABDOVF_SIZE                                0x1
#define _U2ERRIR_ABDOVF_LENGTH                              0x1
#define _U2ERRIR_ABDOVF_MASK                                0x20
#define _U2ERRIR_PERIF_POSN                                 0x6
#define _U2ERRIR_PERIF_POSITION                             0x6
#define _U2ERRIR_PERIF_SIZE                                 0x1
#define _U2ERRIR_PERIF_LENGTH                               0x1
#define _U2ERRIR_PERIF_MASK                                 0x40
#define _U2ERRIR_TXMTIF_POSN                                0x7
#define _U2ERRIR_TXMTIF_POSITION                            0x7
#define _U2ERRIR_TXMTIF_SIZE                                0x1
#define _U2ERRIR_TXMTIF_LENGTH                              0x1
#define _U2ERRIR_TXMTIF_MASK                                0x80
#define _U2ERRIR_U2TXCIF_POSN                               0x0
#define _U2ERRIR_U2TXCIF_POSITION                           0x0
#define _U2ERRIR_U2TXCIF_SIZE                               0x1
#define _U2ERRIR_U2TXCIF_LENGTH                             0x1
#define _U2ERRIR_U2TXCIF_MASK                               0x1
#define _U2ERRIR_U2RXFOIF_POSN                              0x1
#define _U2ERRIR_U2RXFOIF_POSITION                          0x1
#define _U2ERRIR_U2RXFOIF_SIZE                              0x1
#define _U2ERRIR_U2RXFOIF_LENGTH                            0x1
#define _U2ERRIR_U2RXFOIF_MASK                              0x2
#define _U2ERRIR_U2RXBKIF_POSN                              0x2
#define _U2ERRIR_U2RXBKIF_POSITION                          0x2
#define _U2ERRIR_U2RXBKIF_SIZE                              0x1
#define _U2ERRIR_U2RXBKIF_LENGTH                            0x1
#define _U2ERRIR_U2RXBKIF_MASK                              0x4
#define _U2ERRIR_U2FERIF_POSN                               0x3
#define _U2ERRIR_U2FERIF_POSITION                           0x3
#define _U2ERRIR_U2FERIF_SIZE                               0x1
#define _U2ERRIR_U2FERIF_LENGTH                             0x1
#define _U2ERRIR_U2FERIF_MASK                               0x8
#define _U2ERRIR_U2CERIF_POSN                               0x4
#define _U2ERRIR_U2CERIF_POSITION                           0x4
#define _U2ERRIR_U2CERIF_SIZE                               0x1
#define _U2ERRIR_U2CERIF_LENGTH                             0x1
#define _U2ERRIR_U2CERIF_MASK                               0x10
#define _U2ERRIR_U2ABDOVF_POSN                              0x5
#define _U2ERRIR_U2ABDOVF_POSITION                          0x5
#define _U2ERRIR_U2ABDOVF_SIZE                              0x1
#define _U2ERRIR_U2ABDOVF_LENGTH                            0x1
#define _U2ERRIR_U2ABDOVF_MASK                              0x20
#define _U2ERRIR_U2PERIF_POSN                               0x6
#define _U2ERRIR_U2PERIF_POSITION                           0x6
#define _U2ERRIR_U2PERIF_SIZE                               0x1
#define _U2ERRIR_U2PERIF_LENGTH                             0x1
#define _U2ERRIR_U2PERIF_MASK                               0x40
#define _U2ERRIR_U2TXMTIF_POSN                              0x7
#define _U2ERRIR_U2TXMTIF_POSITION                          0x7
#define _U2ERRIR_U2TXMTIF_SIZE                              0x1
#define _U2ERRIR_U2TXMTIF_LENGTH                            0x1
#define _U2ERRIR_U2TXMTIF_MASK                              0x80

// Register: U2ERRIE
#define U2ERRIE U2ERRIE
extern volatile unsigned char           U2ERRIE             __at(0x3DE2);
#ifndef _LIB_BUILD
asm("U2ERRIE equ 03DE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U2TXCIE                :1;
        unsigned U2RXFOIE               :1;
        unsigned U2RXBKIE               :1;
        unsigned U2FERIE                :1;
        unsigned U2CERIE                :1;
        unsigned U2ABDOVE               :1;
        unsigned U2PERIE                :1;
        unsigned U2TXMTIE               :1;
    };
} U2ERRIEbits_t;
extern volatile U2ERRIEbits_t U2ERRIEbits __at(0x3DE2);
// bitfield macros
#define _U2ERRIE_TXCIE_POSN                                 0x0
#define _U2ERRIE_TXCIE_POSITION                             0x0
#define _U2ERRIE_TXCIE_SIZE                                 0x1
#define _U2ERRIE_TXCIE_LENGTH                               0x1
#define _U2ERRIE_TXCIE_MASK                                 0x1
#define _U2ERRIE_RXFOIE_POSN                                0x1
#define _U2ERRIE_RXFOIE_POSITION                            0x1
#define _U2ERRIE_RXFOIE_SIZE                                0x1
#define _U2ERRIE_RXFOIE_LENGTH                              0x1
#define _U2ERRIE_RXFOIE_MASK                                0x2
#define _U2ERRIE_RXBKIE_POSN                                0x2
#define _U2ERRIE_RXBKIE_POSITION                            0x2
#define _U2ERRIE_RXBKIE_SIZE                                0x1
#define _U2ERRIE_RXBKIE_LENGTH                              0x1
#define _U2ERRIE_RXBKIE_MASK                                0x4
#define _U2ERRIE_FERIE_POSN                                 0x3
#define _U2ERRIE_FERIE_POSITION                             0x3
#define _U2ERRIE_FERIE_SIZE                                 0x1
#define _U2ERRIE_FERIE_LENGTH                               0x1
#define _U2ERRIE_FERIE_MASK                                 0x8
#define _U2ERRIE_CERIE_POSN                                 0x4
#define _U2ERRIE_CERIE_POSITION                             0x4
#define _U2ERRIE_CERIE_SIZE                                 0x1
#define _U2ERRIE_CERIE_LENGTH                               0x1
#define _U2ERRIE_CERIE_MASK                                 0x10
#define _U2ERRIE_ABDOVE_POSN                                0x5
#define _U2ERRIE_ABDOVE_POSITION                            0x5
#define _U2ERRIE_ABDOVE_SIZE                                0x1
#define _U2ERRIE_ABDOVE_LENGTH                              0x1
#define _U2ERRIE_ABDOVE_MASK                                0x20
#define _U2ERRIE_PERIE_POSN                                 0x6
#define _U2ERRIE_PERIE_POSITION                             0x6
#define _U2ERRIE_PERIE_SIZE                                 0x1
#define _U2ERRIE_PERIE_LENGTH                               0x1
#define _U2ERRIE_PERIE_MASK                                 0x40
#define _U2ERRIE_TXMTIE_POSN                                0x7
#define _U2ERRIE_TXMTIE_POSITION                            0x7
#define _U2ERRIE_TXMTIE_SIZE                                0x1
#define _U2ERRIE_TXMTIE_LENGTH                              0x1
#define _U2ERRIE_TXMTIE_MASK                                0x80
#define _U2ERRIE_U2TXCIE_POSN                               0x0
#define _U2ERRIE_U2TXCIE_POSITION                           0x0
#define _U2ERRIE_U2TXCIE_SIZE                               0x1
#define _U2ERRIE_U2TXCIE_LENGTH                             0x1
#define _U2ERRIE_U2TXCIE_MASK                               0x1
#define _U2ERRIE_U2RXFOIE_POSN                              0x1
#define _U2ERRIE_U2RXFOIE_POSITION                          0x1
#define _U2ERRIE_U2RXFOIE_SIZE                              0x1
#define _U2ERRIE_U2RXFOIE_LENGTH                            0x1
#define _U2ERRIE_U2RXFOIE_MASK                              0x2
#define _U2ERRIE_U2RXBKIE_POSN                              0x2
#define _U2ERRIE_U2RXBKIE_POSITION                          0x2
#define _U2ERRIE_U2RXBKIE_SIZE                              0x1
#define _U2ERRIE_U2RXBKIE_LENGTH                            0x1
#define _U2ERRIE_U2RXBKIE_MASK                              0x4
#define _U2ERRIE_U2FERIE_POSN                               0x3
#define _U2ERRIE_U2FERIE_POSITION                           0x3
#define _U2ERRIE_U2FERIE_SIZE                               0x1
#define _U2ERRIE_U2FERIE_LENGTH                             0x1
#define _U2ERRIE_U2FERIE_MASK                               0x8
#define _U2ERRIE_U2CERIE_POSN                               0x4
#define _U2ERRIE_U2CERIE_POSITION                           0x4
#define _U2ERRIE_U2CERIE_SIZE                               0x1
#define _U2ERRIE_U2CERIE_LENGTH                             0x1
#define _U2ERRIE_U2CERIE_MASK                               0x10
#define _U2ERRIE_U2ABDOVE_POSN                              0x5
#define _U2ERRIE_U2ABDOVE_POSITION                          0x5
#define _U2ERRIE_U2ABDOVE_SIZE                              0x1
#define _U2ERRIE_U2ABDOVE_LENGTH                            0x1
#define _U2ERRIE_U2ABDOVE_MASK                              0x20
#define _U2ERRIE_U2PERIE_POSN                               0x6
#define _U2ERRIE_U2PERIE_POSITION                           0x6
#define _U2ERRIE_U2PERIE_SIZE                               0x1
#define _U2ERRIE_U2PERIE_LENGTH                             0x1
#define _U2ERRIE_U2PERIE_MASK                               0x40
#define _U2ERRIE_U2TXMTIE_POSN                              0x7
#define _U2ERRIE_U2TXMTIE_POSITION                          0x7
#define _U2ERRIE_U2TXMTIE_SIZE                              0x1
#define _U2ERRIE_U2TXMTIE_LENGTH                            0x1
#define _U2ERRIE_U2TXMTIE_MASK                              0x80

// Register: U1RXB
#define U1RXB U1RXB
extern volatile unsigned char           U1RXB               __at(0x3DE8);
#ifndef _LIB_BUILD
asm("U1RXB equ 03DE8h");
#endif
// aliases
extern volatile unsigned char           U1RXBL              __at(0x3DE8);
#ifndef _LIB_BUILD
asm("U1RXBL equ 03DE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBbits_t;
extern volatile U1RXBbits_t U1RXBbits __at(0x3DE8);
// bitfield macros
#define _U1RXB_RXB_POSN                                     0x0
#define _U1RXB_RXB_POSITION                                 0x0
#define _U1RXB_RXB_SIZE                                     0x8
#define _U1RXB_RXB_LENGTH                                   0x8
#define _U1RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U1RXBLbits_t;
extern volatile U1RXBLbits_t U1RXBLbits __at(0x3DE8);
// bitfield macros
#define _U1RXBL_RXB_POSN                                    0x0
#define _U1RXBL_RXB_POSITION                                0x0
#define _U1RXBL_RXB_SIZE                                    0x8
#define _U1RXBL_RXB_LENGTH                                  0x8
#define _U1RXBL_RXB_MASK                                    0xFF

