GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.h
extern volatile U1UIRbits_t U1UIRbits __at(0x3DF8);
// bitfield macros
#define _U1UIR_ABDIE_POSN                                   0x2
#define _U1UIR_ABDIE_POSITION                               0x2
#define _U1UIR_ABDIE_SIZE                                   0x1
#define _U1UIR_ABDIE_LENGTH                                 0x1
#define _U1UIR_ABDIE_MASK                                   0x4
#define _U1UIR_ABDIF_POSN                                   0x6
#define _U1UIR_ABDIF_POSITION                               0x6
#define _U1UIR_ABDIF_SIZE                                   0x1
#define _U1UIR_ABDIF_LENGTH                                 0x1
#define _U1UIR_ABDIF_MASK                                   0x40
#define _U1UIR_WUIF_POSN                                    0x7
#define _U1UIR_WUIF_POSITION                                0x7
#define _U1UIR_WUIF_SIZE                                    0x1
#define _U1UIR_WUIF_LENGTH                                  0x1
#define _U1UIR_WUIF_MASK                                    0x80
#define _U1UIR_U1ABDIE_POSN                                 0x2
#define _U1UIR_U1ABDIE_POSITION                             0x2
#define _U1UIR_U1ABDIE_SIZE                                 0x1
#define _U1UIR_U1ABDIE_LENGTH                               0x1
#define _U1UIR_U1ABDIE_MASK                                 0x4
#define _U1UIR_U1ABDIF_POSN                                 0x6
#define _U1UIR_U1ABDIF_POSITION                             0x6
#define _U1UIR_U1ABDIF_SIZE                                 0x1
#define _U1UIR_U1ABDIF_LENGTH                               0x1
#define _U1UIR_U1ABDIF_MASK                                 0x40
#define _U1UIR_U1WUIF_POSN                                  0x7
#define _U1UIR_U1WUIF_POSITION                              0x7
#define _U1UIR_U1WUIF_SIZE                                  0x1
#define _U1UIR_U1WUIF_LENGTH                                0x1
#define _U1UIR_U1WUIF_MASK                                  0x80

// Register: U1ERRIR
#define U1ERRIR U1ERRIR
extern volatile unsigned char           U1ERRIR             __at(0x3DF9);
#ifndef _LIB_BUILD
asm("U1ERRIR equ 03DF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIF                  :1;
        unsigned RXFOIF                 :1;
        unsigned RXBKIF                 :1;
        unsigned FERIF                  :1;
        unsigned CERIF                  :1;
        unsigned ABDOVF                 :1;
        unsigned PERIF                  :1;
        unsigned TXMTIF                 :1;
    };
    struct {
        unsigned U1TXCIF                :1;
        unsigned U1RXFOIF               :1;
        unsigned U1RXBKIF               :1;
        unsigned U1FERIF                :1;
        unsigned U1CERIF                :1;
        unsigned U1ABDOVF               :1;
        unsigned U1PERIF                :1;
        unsigned U1TXMTIF               :1;
    };
} U1ERRIRbits_t;
extern volatile U1ERRIRbits_t U1ERRIRbits __at(0x3DF9);
// bitfield macros
#define _U1ERRIR_TXCIF_POSN                                 0x0
#define _U1ERRIR_TXCIF_POSITION                             0x0
#define _U1ERRIR_TXCIF_SIZE                                 0x1
#define _U1ERRIR_TXCIF_LENGTH                               0x1
#define _U1ERRIR_TXCIF_MASK                                 0x1
#define _U1ERRIR_RXFOIF_POSN                                0x1
#define _U1ERRIR_RXFOIF_POSITION                            0x1
#define _U1ERRIR_RXFOIF_SIZE                                0x1
#define _U1ERRIR_RXFOIF_LENGTH                              0x1
#define _U1ERRIR_RXFOIF_MASK                                0x2
#define _U1ERRIR_RXBKIF_POSN                                0x2
#define _U1ERRIR_RXBKIF_POSITION                            0x2
#define _U1ERRIR_RXBKIF_SIZE                                0x1
#define _U1ERRIR_RXBKIF_LENGTH                              0x1
#define _U1ERRIR_RXBKIF_MASK                                0x4
#define _U1ERRIR_FERIF_POSN                                 0x3
#define _U1ERRIR_FERIF_POSITION                             0x3
#define _U1ERRIR_FERIF_SIZE                                 0x1
#define _U1ERRIR_FERIF_LENGTH                               0x1
#define _U1ERRIR_FERIF_MASK                                 0x8
#define _U1ERRIR_CERIF_POSN                                 0x4
#define _U1ERRIR_CERIF_POSITION                             0x4
#define _U1ERRIR_CERIF_SIZE                                 0x1
#define _U1ERRIR_CERIF_LENGTH                               0x1
#define _U1ERRIR_CERIF_MASK                                 0x10
#define _U1ERRIR_ABDOVF_POSN                                0x5
#define _U1ERRIR_ABDOVF_POSITION                            0x5
#define _U1ERRIR_ABDOVF_SIZE                                0x1
#define _U1ERRIR_ABDOVF_LENGTH                              0x1
#define _U1ERRIR_ABDOVF_MASK                                0x20
#define _U1ERRIR_PERIF_POSN                                 0x6
#define _U1ERRIR_PERIF_POSITION                             0x6
#define _U1ERRIR_PERIF_SIZE                                 0x1
#define _U1ERRIR_PERIF_LENGTH                               0x1
#define _U1ERRIR_PERIF_MASK                                 0x40
#define _U1ERRIR_TXMTIF_POSN                                0x7
#define _U1ERRIR_TXMTIF_POSITION                            0x7
#define _U1ERRIR_TXMTIF_SIZE                                0x1
#define _U1ERRIR_TXMTIF_LENGTH                              0x1
#define _U1ERRIR_TXMTIF_MASK                                0x80
#define _U1ERRIR_U1TXCIF_POSN                               0x0
#define _U1ERRIR_U1TXCIF_POSITION                           0x0
#define _U1ERRIR_U1TXCIF_SIZE                               0x1
#define _U1ERRIR_U1TXCIF_LENGTH                             0x1
#define _U1ERRIR_U1TXCIF_MASK                               0x1
#define _U1ERRIR_U1RXFOIF_POSN                              0x1
#define _U1ERRIR_U1RXFOIF_POSITION                          0x1
#define _U1ERRIR_U1RXFOIF_SIZE                              0x1
#define _U1ERRIR_U1RXFOIF_LENGTH                            0x1
#define _U1ERRIR_U1RXFOIF_MASK                              0x2
#define _U1ERRIR_U1RXBKIF_POSN                              0x2
#define _U1ERRIR_U1RXBKIF_POSITION                          0x2
#define _U1ERRIR_U1RXBKIF_SIZE                              0x1
#define _U1ERRIR_U1RXBKIF_LENGTH                            0x1
#define _U1ERRIR_U1RXBKIF_MASK                              0x4
#define _U1ERRIR_U1FERIF_POSN                               0x3
#define _U1ERRIR_U1FERIF_POSITION                           0x3
#define _U1ERRIR_U1FERIF_SIZE                               0x1
#define _U1ERRIR_U1FERIF_LENGTH                             0x1
#define _U1ERRIR_U1FERIF_MASK                               0x8
#define _U1ERRIR_U1CERIF_POSN                               0x4
#define _U1ERRIR_U1CERIF_POSITION                           0x4
#define _U1ERRIR_U1CERIF_SIZE                               0x1
#define _U1ERRIR_U1CERIF_LENGTH                             0x1
#define _U1ERRIR_U1CERIF_MASK                               0x10
#define _U1ERRIR_U1ABDOVF_POSN                              0x5
#define _U1ERRIR_U1ABDOVF_POSITION                          0x5
#define _U1ERRIR_U1ABDOVF_SIZE                              0x1
#define _U1ERRIR_U1ABDOVF_LENGTH                            0x1
#define _U1ERRIR_U1ABDOVF_MASK                              0x20
#define _U1ERRIR_U1PERIF_POSN                               0x6
#define _U1ERRIR_U1PERIF_POSITION                           0x6
#define _U1ERRIR_U1PERIF_SIZE                               0x1
#define _U1ERRIR_U1PERIF_LENGTH                             0x1
#define _U1ERRIR_U1PERIF_MASK                               0x40
#define _U1ERRIR_U1TXMTIF_POSN                              0x7
#define _U1ERRIR_U1TXMTIF_POSITION                          0x7
#define _U1ERRIR_U1TXMTIF_SIZE                              0x1
#define _U1ERRIR_U1TXMTIF_LENGTH                            0x1
#define _U1ERRIR_U1TXMTIF_MASK                              0x80

// Register: U1ERRIE
#define U1ERRIE U1ERRIE
extern volatile unsigned char           U1ERRIE             __at(0x3DFA);
#ifndef _LIB_BUILD
asm("U1ERRIE equ 03DFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U1TXCIE                :1;
        unsigned U1RXFOIE               :1;
        unsigned U1RXBKIE               :1;
        unsigned U1FERIE                :1;
        unsigned U1CERIE                :1;
        unsigned U1ABDOVE               :1;
        unsigned U1PERIE                :1;
        unsigned U1TXMTIE               :1;
    };
} U1ERRIEbits_t;
extern volatile U1ERRIEbits_t U1ERRIEbits __at(0x3DFA);
// bitfield macros
#define _U1ERRIE_TXCIE_POSN                                 0x0
#define _U1ERRIE_TXCIE_POSITION                             0x0
#define _U1ERRIE_TXCIE_SIZE                                 0x1
#define _U1ERRIE_TXCIE_LENGTH                               0x1
#define _U1ERRIE_TXCIE_MASK                                 0x1
#define _U1ERRIE_RXFOIE_POSN                                0x1
#define _U1ERRIE_RXFOIE_POSITION                            0x1
#define _U1ERRIE_RXFOIE_SIZE                                0x1
#define _U1ERRIE_RXFOIE_LENGTH                              0x1
#define _U1ERRIE_RXFOIE_MASK                                0x2
#define _U1ERRIE_RXBKIE_POSN                                0x2
#define _U1ERRIE_RXBKIE_POSITION                            0x2
#define _U1ERRIE_RXBKIE_SIZE                                0x1
#define _U1ERRIE_RXBKIE_LENGTH                              0x1
#define _U1ERRIE_RXBKIE_MASK                                0x4
#define _U1ERRIE_FERIE_POSN                                 0x3
#define _U1ERRIE_FERIE_POSITION                             0x3
#define _U1ERRIE_FERIE_SIZE                                 0x1
#define _U1ERRIE_FERIE_LENGTH                               0x1
#define _U1ERRIE_FERIE_MASK                                 0x8
#define _U1ERRIE_CERIE_POSN                                 0x4
#define _U1ERRIE_CERIE_POSITION                             0x4
#define _U1ERRIE_CERIE_SIZE                                 0x1
#define _U1ERRIE_CERIE_LENGTH                               0x1
#define _U1ERRIE_CERIE_MASK                                 0x10
#define _U1ERRIE_ABDOVE_POSN                                0x5
#define _U1ERRIE_ABDOVE_POSITION                            0x5
#define _U1ERRIE_ABDOVE_SIZE                                0x1
#define _U1ERRIE_ABDOVE_LENGTH                              0x1
#define _U1ERRIE_ABDOVE_MASK                                0x20
#define _U1ERRIE_PERIE_POSN                                 0x6
#define _U1ERRIE_PERIE_POSITION                             0x6
#define _U1ERRIE_PERIE_SIZE                                 0x1
#define _U1ERRIE_PERIE_LENGTH                               0x1
#define _U1ERRIE_PERIE_MASK                                 0x40
#define _U1ERRIE_TXMTIE_POSN                                0x7
#define _U1ERRIE_TXMTIE_POSITION                            0x7
#define _U1ERRIE_TXMTIE_SIZE                                0x1
#define _U1ERRIE_TXMTIE_LENGTH                              0x1
#define _U1ERRIE_TXMTIE_MASK                                0x80
#define _U1ERRIE_U1TXCIE_POSN                               0x0
#define _U1ERRIE_U1TXCIE_POSITION                           0x0
#define _U1ERRIE_U1TXCIE_SIZE                               0x1
#define _U1ERRIE_U1TXCIE_LENGTH                             0x1
#define _U1ERRIE_U1TXCIE_MASK                               0x1
#define _U1ERRIE_U1RXFOIE_POSN                              0x1
#define _U1ERRIE_U1RXFOIE_POSITION                          0x1
#define _U1ERRIE_U1RXFOIE_SIZE                              0x1
#define _U1ERRIE_U1RXFOIE_LENGTH                            0x1
#define _U1ERRIE_U1RXFOIE_MASK                              0x2
#define _U1ERRIE_U1RXBKIE_POSN                              0x2
#define _U1ERRIE_U1RXBKIE_POSITION                          0x2
#define _U1ERRIE_U1RXBKIE_SIZE                              0x1
#define _U1ERRIE_U1RXBKIE_LENGTH                            0x1
#define _U1ERRIE_U1RXBKIE_MASK                              0x4
#define _U1ERRIE_U1FERIE_POSN                               0x3
#define _U1ERRIE_U1FERIE_POSITION                           0x3
#define _U1ERRIE_U1FERIE_SIZE                               0x1
#define _U1ERRIE_U1FERIE_LENGTH                             0x1
#define _U1ERRIE_U1FERIE_MASK                               0x8
#define _U1ERRIE_U1CERIE_POSN                               0x4
#define _U1ERRIE_U1CERIE_POSITION                           0x4
#define _U1ERRIE_U1CERIE_SIZE                               0x1
#define _U1ERRIE_U1CERIE_LENGTH                             0x1
#define _U1ERRIE_U1CERIE_MASK                               0x10
#define _U1ERRIE_U1ABDOVE_POSN                              0x5
#define _U1ERRIE_U1ABDOVE_POSITION                          0x5
#define _U1ERRIE_U1ABDOVE_SIZE                              0x1
#define _U1ERRIE_U1ABDOVE_LENGTH                            0x1
#define _U1ERRIE_U1ABDOVE_MASK                              0x20
#define _U1ERRIE_U1PERIE_POSN                               0x6
#define _U1ERRIE_U1PERIE_POSITION                           0x6
#define _U1ERRIE_U1PERIE_SIZE                               0x1
#define _U1ERRIE_U1PERIE_LENGTH                             0x1
#define _U1ERRIE_U1PERIE_MASK                               0x40
#define _U1ERRIE_U1TXMTIE_POSN                              0x7
#define _U1ERRIE_U1TXMTIE_POSITION                          0x7
#define _U1ERRIE_U1TXMTIE_SIZE                              0x1
#define _U1ERRIE_U1TXMTIE_LENGTH                            0x1
#define _U1ERRIE_U1TXMTIE_MASK                              0x80

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
extern volatile unsigned char           DAC1CON1            __at(0x3E9C);
#ifndef _LIB_BUILD
asm("DAC1CON1 equ 03E9Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
    struct {
        unsigned DAC1R                  :5;
    };
} DAC1CON1bits_t;
